Revit.Elements.Views.View.Discipline
The Discipline of the view.

Revit.Elements.Views.View.SetDiscipline(System.String)
Set Discipline of View.
discipline:
Returns:

Revit.Elements.Views.View.Displaystyle
The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.

Revit.Elements.Views.View.SetDisplayStyle(System.String)
Set DisplayStyle of View.
displayStyle:
Returns:

Revit.Elements.Views.View.Outline
The bounds of the view in paper space (in feet).

Revit.Elements.Views.View.Origin
Returns the origin of the screen.

Revit.Elements.Views.View.GetCategoryOverrides(Revit.Elements.Category)
Gets graphic overrides for a category in view.
category:
Returns:

Revit.Elements.Views.View.IsCategoryHidden(Revit.Elements.Category)
Checks if elements of the given category are set to be invisible (hidden) in this view.
category:
Returns:

Revit.Elements.Views.View.HideCategoriesTemporary(System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Set categories to be temporarily hidden in the view.
categories:
Returns:

Revit.Elements.Views.View.HideElementsTemporary(System.Collections.Generic.IEnumerable{Revit.Elements.Element})
Set elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
elements:
Returns:

Revit.Elements.Views.View.IsolateCategoriesTemporary(System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Set categories to be temporarily isolated in the view.
categories:
Returns:

Revit.Elements.Views.View.IsolateElementsTemporary(System.Collections.Generic.IEnumerable{Revit.Elements.Element})
Set elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
elements:
Returns:

Revit.Elements.Views.View.SetScale(System.Int32)
Set View Scale.
scale: View scale is the ration of true model size to paper size.
View

Revit.Elements.Views.View.Scale
The scale of the view.

Revit.Elements.Views.View.CanViewBeDuplicated(System.String)
Identifies if this view can be duplicated with specified viewDuplicateOption
viewDuplicateOption: Enter View Duplicate Option: Duplicate, AsDependent or WithDetailing.
Returns:

Revit.Elements.Views.View.DuplicateView(Revit.Elements.Views.View,System.String,System.String,System.String)
Duplicates A view.
view: The View to be Duplicated
viewDuplicateOption: Enter View Duplicate Option: Duplicate, AsDependent or WithDetailing.
prefix:
suffix:
Returns:

Revit.Elements.Views.View.CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.

Revit.Elements.Views.View.CropBoxActive
Whether or not the Crop Box/Region is active for the view.

Revit.Elements.Views.View.CropBoxVisible
Whether or not the Crop Box/Region is visible for the view.

Revit.Elements.Views.View.SetCropBoxActive(System.Boolean)
Set CropBox Active status.
isActive:
Returns:

Revit.Elements.Views.View.SetCropBoxVisible(System.Boolean)
Set CropBox visible status.
isVisible:
Returns:

Revit.Elements.Views.View.SetCropBox(Autodesk.DesignScript.Geometry.BoundingBox)
Set CropBox for a view.
boundingBox:
Returns:

Revit.Elements.Views.View.ViewDirection
The direction towards the viewer.

Revit.Elements.Views.View.RightDirection
The direction towards the right side of the screen.

Revit.Elements.Views.View.SketchPlane
The sketch plane assigned to the view for model curve creation.

Revit.Elements.Views.View.SetSketchPlane(Revit.Elements.SketchPlane)
Set SketchPlane of View.
sketchPlane:
Returns:

Revit.Elements.Views.View.Partsvisibility
The visibility setting for parts in this view.

Revit.Elements.Views.View.SetPartsVisibility(System.String)
Set PartsVisibility of view
partsVisibility:
Returns: